backend/app/controllers/api/v1/issues_controller.rb

  def index
    @issues = Issue.all.sort { |issue| issue.votes }
---
SELECT "issues".* FROM "issues"