backend/app/controllers/api/v1/issues_controller.rb

SELECT "issues".* FROM "issues" ORDER BY "issues"."votes" DESC
---
  def index
    issues = Issue.order(votes: :desc)

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Category"], ["created_at", "2019-03-25 19:27:36.558018"], ["updated_at", "2019-03-25 19:27:36.558018"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."title" = $1 LIMIT $2  [["title", "traffic"], ["LIMIT", 1]]
INSERT INTO "issues" ("title", "zipcode", "votes", "category_id", "description", "resolved", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @category = Category.find_or_create_by(title: params[:category])
    @issue = Issue.new(title: params[:title], description: params[:description], zipcode: params[:zipcode], category_id: @category.id, votes: 0, resolved: false)

    if @issue.save

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "issues" SET "votes" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["votes", 2001], ["updated_at", "2019-03-26 13:40:43.699497"], ["id", 2]]
---
  def upvote
    issue = Issue.find(params[:id])

    issue.votes += 1
    issue.save

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "issues" SET "votes" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["votes", 2000], ["updated_at", "2019-03-26 13:40:44.617812"], ["id", 2]]
---
  def downvote
    issue = Issue.find(params[:id])

    issue.votes -= 1
    issue.save